//
// Created by Константинова Вера Валентиновна on 08.11.2022.
//
#include <iostream>
#include <cstdlib>

using namespace std;

void printTest(int test[7], string output) {
    cout << "in: ";
    for (int i = 0; i < 7; i++) {
        cout << test[i] << ".0 ";
    }
    cout << endl << "out: " << output << endl;
}

//int main() {
//    int squareTest1[7] = {0b1111111,
//                          0b1000001,
//                          0b1000001,
//                          0b1000001,
//                          0b1000001,
//                          0b1000001,
//                          0b1111111};
//
//    int squareTest2[7] = {0b0000000,
//                          0b0111110,
//                          0b0100010,
//                          0b0100010,
//                          0b0100010,
//                          0b0111110,
//                          0b0000000};
//
//    int squareTest3[7] = {0b0000000,
//                          0b0000000,
//                          0b0011100,
//                          0b0010100,
//                          0b0011100,
//                          0b0000000,
//                          0b0000000};
//
//    int squareTest4[7] = {0b1111000,
//                          0b1001000,
//                          0b1001000,
//                          0b1111000,
//                          0b0000000,
//                          0b0000000,
//                          0b0000000};
//
//    int squareTest5[7] = {0b0000000,
//                          0b0000000,
//                          0b0000000,
//                          0b0001111,
//                          0b0001001,
//                          0b0001001,
//                          0b0001111};
//
//    int squareTest6[7] = {0b0000000,
//                          0b0000000,
//                          0b1111100,
//                          0b1000100,
//                          0b1000100,
//                          0b1000100,
//                          0b1111100};
//
//    int squareTest7[7] = {0b0000111,
//                          0b0000101,
//                          0b0000111,
//                          0b0000000,
//                          0b0000000,
//                          0b0000000,
//                          0b0000000};
//
//    int squareTest8[7] = {0b0111100,
//                          0b0100100,
//                          0b0100100,
//                          0b0111100,
//                          0b0000000,
//                          0b0000000,
//                          0b0000000};
//
//    int squareTest9[7] = {0b0000000,
//                          0b0000000,
//                          0b0000000,
//                          0b0000111,
//                          0b0000101,
//                          0b0000111,
//                          0b0000000};
//
//    int squareTest10[7] = {0b0000000,
//                           0b1110000,
//                           0b1010000,
//                           0b1110000,
//                           0b0000000,
//                           0b0000000,
//                           0b0000000};
//
//    int triangleTest1[7] = {0b1111111,
//                            0b0100010,
//                            0b0010100,
//                            0b0001000,
//                            0b0000000,
//                            0b0000000,
//                            0b0000000};
//
//    int triangleTest2[7] = {0b1111111,
//                            0b1000010,
//                            0b1000100,
//                            0b1001000,
//                            0b1010000,
//                            0b1100000,
//                            0b1000000};
//
//    int triangleTest3[7] = {0b0000000,
//                            0b0000000,
//                            0b0001000,
//                            0b0010100,
//                            0b0100010,
//                            0b1111111,
//                            0b0000000};
//
//    int triangleTest4[7] = {0b0000100,
//                            0b0001100,
//                            0b0010100,
//                            0b0100100,
//                            0b0010100,
//                            0b0001100,
//                            0b0000100};
//
//    int triangleTest5[7] = {0b1111110,
//                            0b1000100,
//                            0b1010000,
//                            0b1000000,
//                            0b0000000,
//                            0b0000000,
//                            0b0000000};
//
//    int triangleTest6[7] = {0b0000000,
//                            0b0000000,
//                            0b0000001,
//                            0b0000011,
//                            0b0000101,
//                            0b0001001,
//                            0b0011111};
//
//    int triangleTest7[7] = {0b0000000,
//                            0b0000000,
//                            0b1000000,
//                            0b1100000,
//                            0b1010000,
//                            0b1111000,
//                            0b0000000};
//
//    int triangleTest8[7] = {0b1000000,
//                            0b1010000,
//                            0b1001000,
//                            0b1000100,
//                            0b1001000,
//                            0b1010000,
//                            0b1000000};
//
//    int triangleTest9[7] = {0b0000000,
//                            0b1111100,
//                            0b0101000,
//                            0b0010000,
//                            0b0000000,
//                            0b0000000,
//                            0b0000000};
//
//    int triangleTest10[7] = {0b0000000,
//                             0b0000000,
//                             0b1111111,
//                             0b0100010,
//                             0b0010100,
//                             0b0001000,
//                             0b0000000};
//
//    int circleTest1[7] = {0b0000000,
//                          0b0011100,
//                          0b0100010,
//                          0b0100010,
//                          0b0100010,
//                          0b0011100,
//                          0b0000000};
//
//    int circleTest2[7] = {0b0000000,
//                          0b0001100,
//                          0b0010010,
//                          0b0001100,
//                          0b0000000,
//                          0b0000000,
//                          0b0000000};
//
//    int circleTest3[7] = {0b0000000,
//                          0b0000000,
//                          0b0011100,
//                          0b0100010,
//                          0b0100010,
//                          0b0011100,
//                          0b0000000};
//
//    int circleTest4[7] = {0b0000000,
//                          0b0000000,
//                          0b0000000,
//                          0b0000000,
//                          0b0000110,
//                          0b0001001,
//                          0b0000110};
//
//    int circleTest5[7] = {0b0111000,
//                          0b1000100,
//                          0b1000100,
//                          0b1000100,
//                          0b0111000,
//                          0b0000000,
//                          0b0000000};
//
//    int circleTest6[7] = {0b0000000,
//                          0b0110000,
//                          0b1001000,
//                          0b1001000,
//                          0b0110000,
//                          0b0000000,
//                          0b0000000};
//
//    int circleTest7[7] = {0b0000000,
//                          0b0000000,
//                          0b0111000,
//                          0b1000100,
//                          0b1000100,
//                          0b1000100,
//                          0b0111000};
//
//    int circleTest8[7] = {0b0001110,
//                          0b0010001,
//                          0b0001110,
//                          0b0000000,
//                          0b0000000,
//                          0b0000000,
//                          0b0000000};
//
//    int circleTest9[7] = {0b0000000,
//                          0b0111000,
//                          0b1000100,
//                          0b0111000,
//                          0b0000000,
//                          0b0000000,
//                          0b0000000};
//
//    int circleTest10[7] = {0b0000000,
//                           0b0000000,
//                           0b0111100,
//                           0b1000010,
//                           0b1000010,
//                           0b0111100,
//                           0b0000000};
//
//    cout << "topology: 7 3 5 2 4 3" << endl;
//    printTest(squareTest1, "1.0 0.0 0.0");
//    printTest(squareTest2, "1.0 0.0 0.0");
//    printTest(squareTest3, "1.0 0.0 0.0");
//    printTest(squareTest4, "1.0 0.0 0.0");
//    printTest(squareTest5, "1.0 0.0 0.0");
//    printTest(squareTest6, "1.0 0.0 0.0");
//    printTest(squareTest7, "1.0 0.0 0.0");
//    printTest(squareTest8, "1.0 0.0 0.0");
//    printTest(squareTest9, "1.0 0.0 0.0");
//    printTest(squareTest10, "1.0 0.0 0.0");
//
//    printTest(triangleTest1, "0.0 1.0 0.0");
//    printTest(triangleTest2, "0.0 1.0 0.0");
//    printTest(triangleTest3, "0.0 1.0 0.0");
//    printTest(triangleTest4, "0.0 1.0 0.0");
//    printTest(triangleTest5, "0.0 1.0 0.0");
//    printTest(triangleTest6, "0.0 1.0 0.0");
//    printTest(triangleTest7, "0.0 1.0 0.0");
//    printTest(triangleTest8, "0.0 1.0 0.0");
//    printTest(triangleTest9, "0.0 1.0 0.0");
//    printTest(triangleTest10, "0.0 1.0 0.0");
//
//    printTest(circleTest1, "0.0 0.0 1.0");
//    printTest(circleTest2, "0.0 0.0 1.0");
//    printTest(circleTest3, "0.0 0.0 1.0");
//    printTest(circleTest4, "0.0 0.0 1.0");
//    printTest(circleTest5, "0.0 0.0 1.0");
//    printTest(circleTest6, "0.0 0.0 1.0");
//    printTest(circleTest7, "0.0 0.0 1.0");
//    printTest(circleTest8, "0.0 0.0 1.0");
//    printTest(circleTest9, "0.0 0.0 1.0");
//    printTest(circleTest10, "0.0 0.0 1.0");
//
//}

